{
  "version": "https://jsonfeed.org/version/1",
  "title": "mx.sb",
  "home_page_url": "https://mx.sb/",
  "feed_url": "https://mx.sb/feed.json",
  "description": "I am writing about my experiences as a naval navel-gazer.",
  "author": {
    "name": "M",
    "url": "https://mx.sb"
  },
  "items": [
    {
      "id": "https://mx.sb/posts/host-your-own-tor-exit-relay-node/",
      "url": "https://mx.sb/posts/host-your-own-tor-exit-relay-node/",
      "title": "Host your own Tor exit / relay node",
      "content_html": "<p>Tor, short for The Onion Router, is an anonymity network that enables users to browse the internet anonymously by encrypting their traffic and routing it through a series of nodes. These nodes can be run by anyone, and the final node, known as the exit node, is responsible for sending traffic back onto the regular internet. Running a Tor exit node is an important way to contribute to the privacy and freedom of the internet, but it requires some technical expertise and responsibility. In this blog post, we’ll walk you through the process of hosting a Tor exit node.</p>\n<h2>Step 0: Consider before deploy</h2>\n<p>Here are some things to consider:</p>\n<ul>\n<li>Legal considerations: In some countries, hosting a Tor exit node is illegal, and you could face legal consequences for doing so. You should research the laws in your country and make sure that hosting a Tor exit node is legal before proceeding.</li>\n<li>Bandwidth and resource consumption: Tor exit nodes can consume a lot of bandwidth, and you will need to have a fast and reliable internet connection to handle the traffic. You may also need to pay for additional bandwidth if your hosting plan has a bandwidth cap.</li>\n<li>Technical expertise: Hosting a Tor exit node requires some technical expertise and experience with Linux administration. You will need to set up a server, install and configure Tor software, and maintain the node to ensure that it is running smoothly.</li>\n<li>Risks associated with illegal activity: As an exit node operator, you may be held responsible for any illegal activity that passes through your node. While Tor is designed to protect the anonymity of its users, it is not foolproof, and law enforcement agencies may be able to trace activity back to your node.</li>\n<li>Reputation risk: Hosting a Tor exit node may attract unwanted attention and scrutiny from law enforcement agencies, as well as from your internet service provider and other organizations. It is important to consider the potential risks to your reputation before proceeding.</li>\n</ul>\n<p>There are three types of Tor nodes that you can host: <strong>middle/guard</strong> nodes, <strong>bridge</strong> nodes, and <strong>exit</strong> nodes. Middle nodes are relays that help to route traffic between different nodes in the Tor network, but do not serve as the final node for traffic leaving the network. Bridge nodes are similar to middle nodes, but they are not publicly listed in the Tor directory, which can help users bypass censorship and surveillance. Exit nodes, on the other hand, are the final nodes for traffic leaving the Tor network and provide a gateway for users to access the regular internet anonymously. However, hosting an exit node comes with significant legal and ethical responsibilities, as exit nodes can be used to route traffic for illegal activities. The decision to host a Tor node, and what type of node to host, should be made after careful consideration of the risks and benefits, and in compliance with the Tor Project's guidelines and policies.</p>\n<h2>Step 1: Choose a Location</h2>\n<p>The first step in hosting a Tor exit node is to choose a location for your server. You will want to choose a location with a fast and reliable internet connection, as well as a high bandwidth cap or an unlimited plan, since exit nodes can consume a lot of bandwidth. It’s also important to choose a location where Tor is legal and not blocked, as hosting an exit node in a country where Tor is not allowed can result in legal issues.</p>\n<h2>Step 2: Set Up Your Server</h2>\n<p>Once you have chosen a location, you will need to set up a server. You can use a virtual private server (VPS) or a dedicated server, depending on your budget and needs. You will need to install a Linux operating system, such as Ubuntu or Debian, and configure it for use as a Tor exit node. The Tor Project provides detailed instructions for setting up a Tor exit node on Linux.</p>\n<h2>Step 3: Install and Configure Tor</h2>\n<p>Next, you will need to install the Tor software and configure it for use as an exit node. You can install Tor using the package manager for your Linux distribution, or you can download and install it from the Tor Project’s website. Once installed, you will need to configure Tor to run as an exit node, which involves editing the Tor configuration file. The Tor Project provides detailed instructions for configuring Tor as an exit node.</p>\n<p>The Tor Project has a handful of documentation to help you through the installation process: <a href=\"https://community.torproject.org/onion-services/setup/install/\">https://community.torproject.org/onion-services/setup/install/</a>.</p>\n<p>I also found this video useful during setup: <a href=\"https://www.youtube.com/watch?v=EMZqZ3XX8Eo\">https://www.youtube.com/watch?v=EMZqZ3XX8Eo</a></p>\n<p>For instance, on Debian/Ubuntu, you can simply run the command `apt install tor` to install the software, and then modify the configuration file located at `/etc/tor/torrc` using your preferred text editor. This resource can also be useful if you intend to set up a Tor relay. One thing to keep in mind is that if you plan on hosting an exit node, the setup provided in the tutorial will block all exit traffic. In this case, you may want to consider using the following configuration setup instead:</p>\n<pre><code class=\"language-shell\">Exitpolicy accept *:443\nExitpolicy accept *:80\nExitpolicy reject *:*\nExitRelay 1\n</code></pre>\n<p>Additionally, to prevent abuse, it is recommended to avoid opening any email or other ports that may be susceptible to spam or misuse.</p>\n<p>Example config:</p>\n<pre><code class=\"language-shell\">ORPort 20308\nExitpolicy accept *:443\nExitpolicy accept *:80\nExitpolicy reject *:*\nExitRelay 1\nNickname yourtorrelaynickname\nContactInfo youremail@mail.com\nIPv6Exit 1\n</code></pre>\n<p>To set up an obfs4 bridge, use the following additional lines:</p>\n<pre><code class=\"language-shell\">ServerTransportPlugin obfs4 exec /usr/bin/obfs4proxy\nServerTransportListenAddr obfs4 0.0.0.0:40001\nExtORPort auto\n</code></pre>\n<p>Read more about obfs4 bridge setup on <a href=\"https://community.torproject.org/relay/setup/bridge\">https://community.torproject.org/relay/setup/bridge</a></p>\n<p>For hosting different types of relay nodes, Tor Project has a wiki: <a href=\"https://community.torproject.org/relay/setup/\">https://community.torproject.org/relay/setup/</a></p>\n<p>For exit node, it is required to setup your local dns resolver:</p>\n<p>Debian/Ubuntu</p>\n<p>The following commands install unbound, backup your DNS configuration, and tell the system to use the local resolver:</p>\n<pre><code class=\"language-shell\">apt install unbound\ncp /etc/resolv.conf /etc/resolv.conf.backup\necho nameserver 127.0.0.1 &gt; /etc/resolv.conf\n</code></pre>\n<p>To avoid unwanted configuration changed (for example by the DHCP client):</p>\n<pre><code class=\"language-shell\">chattr +i /etc/resolv.conf\n</code></pre>\n<p>The Debian configuration ships with QNAME minimization (RFC7816) enabled by default, so you don't need to enable it explicitly. The Unbound resolver you just installed also does DNSSEC validation.</p>\n<p>If you are running <strong>systemd-resolved</strong> with its stub listener, you may need to do a bit more than just that. Please refer to the <a href=\"https://www.freedesktop.org/software/systemd/man/resolved.conf.html\">resolved.conf manpage</a>.</p>\n<h2>Step 4: Test Your Exit Node</h2>\n<p>After you have configured Tor, you will want to test your exit node to make sure it is working properly. You can use the Tor Browser to test your exit node by connecting to a website and verifying that your IP address is listed as the exit node IP address. You can also use the Tor Metrics website to monitor the bandwidth usage and performance of your exit node.</p>\n<p>To see if you exit node is running, check this bulk list: <a href=\"https://check.torproject.org/torbulkexitlist\">https://check.torproject.org/torbulkexitlist</a></p>\n<h2>Step 5: Monitor Your Exit Node</h2>\n<p>Once your exit node is up and running, it’s important to monitor it to ensure that it is not being used for malicious purposes. The Tor Project provides a list of recommended monitoring tools and techniques, including using log analysis software to track the traffic passing through your exit node and monitoring the Tor Metrics website for unusual activity. It’s also a good idea to regularly check the Tor Project’s guidelines for running an exit node to make sure you are complying with their policies.</p>\n<p>T﻿or Project also provides a helpful page for post-install and good practice: <a href=\"https://community.torproject.org/relay/setup/post-install/\">https://community.torproject.org/relay/setup/post-install/</a></p>\n<p>Elsa node is an Tor exit node I am currently running, see:</p>\n<p><a href=\"https://metrics.torproject.org/rs.html#search/elsa\">https://metrics.torproject.org/rs.html#search/elsa</a></p>\n<h2>Conclusion</h2>\n<p>Running a Tor exit node can be a rewarding way to contribute to the privacy and freedom of the internet, but it requires some technical expertise and responsibility. By following the steps outlined in this blog post, you can set up and run a Tor exit node that provides a valuable service to the Tor network while maintaining the security and privacy of both your server and its users.</p>",
      "date_published": "2023-03-31T01:53:31Z"
    },
    {
      "id": "https://mx.sb/posts/free-gts-ssl-with-caddy/",
      "url": "https://mx.sb/posts/free-gts-ssl-with-caddy/",
      "title": "Get free GTS SSL for your website with Caddy",
      "content_html": "<p>Are you interested in learning how to obtain a free SSL certificate for your website from Google Trust Services using Caddy? Let me guide you through the process.</p>\n<p>As you may be aware, Let's Encrypt's root certificate has expired, and some website owners have switched to a different certificate issuer or are dealing with Let's Encrypt's new root. For my personal websites, I use ZeroSSL and Amazon SSL, which work great for me, and Sectigo Root benefits from its accessible OSCP servers. However, I recently learned that Google is offering free public certificates for websites, which is pretty cool, and I decided to secure my website with GTS.</p>\n<p>Here's how you can get a free SSL certificate from Google and install it with Caddy:</p>\n<ol>\n<li>\n<p>Create a project on Google Cloud Platform first (it's free, and you get a free $200 credit when you sign up).</p>\n</li>\n<li>\n<p>Get your project ID: go to your GCP dashboard (<a href=\"https://console.cloud.google.com/apis/dashboard\">https://console.cloud.google.com/apis/dashboard</a>) and click the &quot;My Project&quot; button in the top left corner. Your project ID (e.g., sharp-fire-310310) should appear. Alternatively, you can copy your project ID after query in url ?project=<Project ID>.</p>\n</li>\n<li>\n<p>Go to https://console.cloud.google.com/apis/library/publicca.googleapis.com?project=<Project ID> to activate your Public Certificate Authority API. where Project ID is what you obtained in the previous step. Enable it for free.</p>\n</li>\n<li>\n<p>Create an authority key: In the top right corner, click the Cloud Shell icon. Type in the following command:</p>\n<pre><code class=\"language-shell\">gcloud config set project &lt;Project ID&gt;\ngcloud beta publicca external-account-keys create\n</code></pre>\n<p>W﻿here Project ID is the same as previous step. (When it prompts up for authorization, click accept)</p>\n<p>I﻿f the key created successfully, it should return something like</p>\n<pre><code class=\"language-shell\">Created an external account key\n[b64MacKey: 3f90fbuKnl9a0c8ItD-BZygttn-5yCxgak7NKVXHml5x3NM09cygJgbVZd1EDWxFif_OGzx2ZtDJCcH19_9QMA\nkeyId: 5743b1609344f82973328515f883faa1\n</code></pre>\n<p>T﻿he  phrase after b64MacKey is your key, and after keyId is key id you need to use.</p>\n</li>\n<li>\n<p>Update your Caddyfile: add following to your global option for Caddy</p>\n<pre><code class=\"language-shell\">email &lt;Your email&gt;\nacme_ca https://dv.acme-v02.api.pki.goog/directory\nacme_eab {\n        key_id &lt;Your keyId&gt;\n        mac_key &lt;Your b64MacKey&gt;\n}\n</code></pre>\n<p>I﻿f you aren't familiar with Caddy global options, see <a href=\"https://caddyserver.com/docs/caddyfile/options#global-options\">https://caddyserver.com/docs/caddyfile/options#global-options</a></p>\n</li>\n<li>\n<p>R﻿eload Caddy: after run Caddy reload or systemctl restart caddy. Your GTS certificate  should now be ready. (This is faster than I expected since Lets and ZeroSSL issue SSL certificates slower than this).</p>\n</li>\n<li>\n<p>To confirm that your certificate is ready, run systemctl status caddy, and you should see output indicating that your GTS SSL is active.</p>\n<pre><code class=\"language-shell\">Feb 15 11:15:24 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477724.6448865,&quot;logger&quot;:&quot;tls&quot;,&quot;msg&quot;:&quot;served key authentication certificate&quot;,&quot;server_name&quot;:&quot;&lt;Your domain&gt;&quot;,&quot;challenge&quot;:&quot;tls-alpn-01&quot;,&quot;remote&quot;:&quot;46.29.169.36:63136&quot;,&quot;distributed&quot;:false}\nFeb 15 11:15:28 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477728.6581016,&quot;logger&quot;:&quot;http.acme_client&quot;,&quot;msg&quot;:&quot;authorization finalized&quot;,&quot;identifier&quot;:&quot;&lt;Your domain&gt;&quot;,&quot;authz_status&quot;:&quot;valid&quot;}\nFeb 15 11:15:28 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477728.6589515,&quot;logger&quot;:&quot;http.acme_client&quot;,&quot;msg&quot;:&quot;validations succeeded; finalizing order&quot;,&quot;order&quot;:&quot;https://dv.acme-v02.api.pki.goog/order/oCVILp8kjElvQnZWnvFX0A&quot;}\nFeb 15 11:15:34 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477734.5884278,&quot;logger&quot;:&quot;http.acme_client&quot;,&quot;msg&quot;:&quot;successfully downloaded available certificate chains&quot;,&quot;count&quot;:1,&quot;first_url&quot;:&quot;https://dv.acme-v02.api.pki.goog/cert/4S6dCCidjIf3eN-C-pB-DhajSt0j7XoUQqTDq8fpltw&quot;}\nFeb 15 11:15:34 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477734.589921,&quot;logger&quot;:&quot;tls.obtain&quot;,&quot;msg&quot;:&quot;certificate obtained successfully&quot;,&quot;identifier&quot;:&quot;&lt;Your domain&gt;&quot;}\nFeb 15 11:15:34 misty caddy[2981403]: {&quot;level&quot;:&quot;info&quot;,&quot;ts&quot;:1676477734.5903862,&quot;logger&quot;:&quot;tls.obtain&quot;,&quot;msg&quot;:&quot;releasing lock&quot;,&quot;identifier&quot;:&quot;&lt;Your domain&gt;&quot;}\n</code></pre>\n</li>\n</ol>\n<p>And that's it! Your website should now be secured with a free SSL certificate from Google Trust Services. Check it out and enjoy the added security. I've included an image of a website secured with GTS SSL for reference</p>\n<p><img src=\"https://ucarecdn.com/0045ec29-51b0-4ed9-827f-2419623e4f4a/\" alt=\"Website with GTS SSL\"></p>",
      "date_published": "2023-02-15T17:10:17Z"
    },
    {
      "id": "https://mx.sb/posts/helloworld/",
      "url": "https://mx.sb/posts/helloworld/",
      "title": "Hello World",
      "content_html": "<p>This is a typical helloworld post published on mx.sb.</p>\n<pre><code>Hello, world!\n</code></pre>\n<p><a href=\"https://mx.sb/about/\">Check what technologies used in this blog</a></p>",
      "date_published": "2022-12-07T00:00:00Z"
    }
  ]
}